src/depot/app/controllers/carts_controller.rb

  def create
    @cart = Cart.new(params[:cart])

    respond_to do |format|
      if @cart.save
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 12 Feb 2014 09:10:35 UTC +00:00], ["updated_at", Wed, 12 Feb 2014 09:10:35 UTC +00:00]]