src/depot/app/controllers/line_items_controller.rb

  def edit
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product: product)
    # the following needed to be added... product was not stored in db
    @line_item.product = product
    @line_item.product.title = product.title
    @line_item.price = product.price

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."id" ASC LIMIT 1  [["id", 1]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Wed, 12 Feb 2014 09:10:35 UTC +00:00], ["updated_at", Wed, 12 Feb 2014 09:10:35 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Tue, 18 Feb 2014 01:24:42 UTC +00:00], ["product_id", 1], ["updated_at", Tue, 18 Feb 2014 01:24:42 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 4  [["quantity", 2], ["updated_at", Tue, 18 Feb 2014 02:14:39 UTC +00:00]]

  def update
    @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]