src/depot/app/controllers/users_controller.rb

  def index
    @users = User.order(:name)
---
SELECT "users".* FROM "users" ORDER BY name

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
UPDATE "users" SET "name" = 'sam', "password_digest" = '$2a$10$PZ8tBI.cA4BEJesqtKhnLeNXB/c./pwXso0cqlf71niN5tEq30B2e', "updated_at" = '2014-02-12 09:10:36.776507' WHERE "users"."id" = 980190962

  def destroy
    @user = User.find(params[:id])
    begin
      @user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = 980190962 LIMIT 1
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 980190962]]